In [3]:
from platform import python_version
print(python_version())

3.12.3

In [4]:
# Imports
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import statsmodels.api as sm

### Carregando o Data Set

In [5]:
dataset = pd.read_csv('datasetsm.csv')

In [6]:
dataset.shape

(3000, 7)

In [7]:
dataset.head()

   valor_aluguel  area_m2  ...  numero_cozinhas  codigo_bairro
0      120.97436       35  ...                0           1112
1      436.97433      104  ...                0           1112
2      355.74360       29  ...                0           2114
3      282.92310       39  ...                0           2148
4      807.23080       97  ...                0           2222

[5 rows x 7 columns]

### Analise Exploratória

In [9]:
# Verificar se há valores ausentes
dataset.isnull().sum()

valor_aluguel        0
area_m2              0
ano_construcao       0
codigo_localidade    0
numero_banheiros     0
numero_cozinhas      0
codigo_bairro        0
dtype: int64

In [12]:
# Resumo estatistico do Dataset - ATENÇÃO
dataset.describe()

       valor_aluguel      area_m2  ...  numero_cozinhas  codigo_bairro
count    3000.000000  3000.000000  ...      3000.000000    3000.000000
mean      459.643146    67.363333  ...         0.042000    1173.798667
std       195.865692    23.675758  ...         0.200623     678.187690
min        40.512820    20.000000  ...         0.000000     113.000000
25%       320.961530    51.000000  ...         0.000000     561.750000
50%       426.897435    65.000000  ...         0.000000    1025.000000
75%       560.282055    81.000000  ...         0.000000    1714.000000
max      1843.384600   160.000000  ...         1.000000    2529.000000

[8 rows x 7 columns]

In [13]:
# Resumo da variável alvo
dataset['valor_aluguel'].describe()

count    3000.000000
mean      459.643146
std       195.865692
min        40.512820
25%       320.961530
50%       426.897435
75%       560.282055
max      1843.384600
Name: valor_aluguel, dtype: float64

In [14]:
dataset['area_m2'].describe()

count    3000.000000
mean       67.363333
std        23.675758
min        20.000000
25%        51.000000
50%        65.000000
75%        81.000000
max       160.000000
Name: area_m2, dtype: float64